Autodesk.Revit.DB.FamilySizeTableErrorInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FamilySizeTableErrorInfo.InvalidRowIndex
The index of the invalid row.
Since:
2014

Autodesk.Revit.DB.FamilySizeTableErrorInfo.InvalidColumnIndex
The index of the invalid column.
Since:
2014

Autodesk.Revit.DB.FamilySizeTableErrorInfo.InvalidHeaderText
The invalid header text.
Since:
2014

Autodesk.Revit.DB.FamilySizeTableErrorInfo.FilePath
The path of the imported CSV file.
Since:
2014

Autodesk.Revit.DB.FamilySizeTableErrorInfo.FamilySizeTableErrorType
The error type.
Since:
2014

Autodesk.Revit.DB.FamilySizeTableErrorInfo.#ctor
Constructs a new FamilySizeTableErrorInfo with default settings.
Since:
2014

Autodesk.Revit.DB.FamilySizeTableErrorInfo
Error information generated from the CSV file import of a FamilySizeTable.
Since:
2014